<a href="https://colab.research.google.com/github/ehom/colab_notebooks/blob/main/intro_to_data_science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip3 install numpy

Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (1.19.5)

# Week One

In [ ]:
from pprint import PrettyPrinter

lowercase = 'abcdefghijklmnopqrstuvwxyz'
digits = '0123456789'

answer = [first + second + third + fourth for first in lowercase for second in lowercase for third in digits for fourth in digits]

pp = PrettyPrinter(indent=4)

pp.pprint(answer)

In [ ]:
import numpy as np
import math

array1 = np.array([[1,2,3], [4,5,6]])
print(array1.dtype)

array1 = np.array([[1.1,2.2,3], [4.0,5,6]])
print(array1.dtype)

int64
float64

In [ ]:
import pandas as pd

print("hello, pandas")

hello, pandas

In [ ]:
import re

# \w
# covers A-Z, a-z, 0-9, underscore

pattern = "([\w+]+\.)?[\w+]+\.com$"

urls = [
  "www.aBC.com",     
  "abc.com",
  "abc..com",
  "abc",
  "www.xyz.com",
  "ab_c.de8f.com"
]

for url in urls:
  result = re.match(pattern, url)
  if result is None:
    print("Invalid: {}".format(url))

Invalid: abc..com
Invalid: abc

### Problem 1 of 5
Capture words that start with a vowel letter (aeiou), but ends with a non-vowel letter. 

There can be 0 or more letters in between. Also, it is not allowed to have other characters besides letter in between. e.g. your regular expression should match unicorn, element, but should not match: banana, apple. 

All letters are lowercase.

In [ ]:
import re

pattern = "[aeiou][a-z]*[^aeiou]$"

strings = [
  "unicorn",
  "element",
  "banana",
  "apple"
]

for string in strings:
  result = re.match(pattern, string)
  if result is None:
    print("Invalid: {}".format(string))

Invalid: banana
Invalid: apple

### Problem 2 of 5
Capture numbers in octal or hexadecimal representation in Python.

Octal numbers start with a prefix "0o" (number zero followed by lowercase letter o), and are followed by one or more numbers in the range of 0 to 7. E.g. 0o112, 0o237, 0o07.

Hexadecimal numbers start with a prefix "0x", and are followed by one or more numbers in the range of 0 to 9 or lowercase letters in the range of a to f. E.g. 0xf3, 0x1d, 0x072.


### Problem 3 of 5

Capture a "Firstname Lastname" **at the beginning of each line**.

e.g. for sentence

**Jane Doe is eating breakfast**.

Your regex should capture "Jane Doe".

But in sentence

**Today is John Doe's birthday.**

Your regex should NOT capture the name in the sentence as it does not start from the beginning of the string.

Notice that the name should consist of two words. Each word should start with a capital letter and has zero or more lowercase letters followed. No other symbols are allowed in the name.

Some valid names are: **Issac Newton, L Zhang**;

Some invalid names are: **john doe, Ling-Ling Li**.

### Problem 4 of 5

In this problem, we are using re.findall. Notice that if you use normal parentheses for grouping, re.findall only returns the value in the group but does not return the complete matched string.

Match any price in the form `$3.45` or `$23.32` or `$400`. Your regex should capture strings meeting the following requirements:
- Start with a "$" sign;
- The price should be an integer, or have exactly two digits after the decimal point.

In [ ]:
import re

pattern = ""

### Problem 5 of 5

Capture email address with letters, numbers, underscore and dots. A valid email address defined in this problem must meet the following requirements:
- Has an "@" symbol;
- Before the "@" symbol, there can be one or more strings made of letters, numbers and underscores, separated by a single dot.
- After the "@" symbol, there can two or more strings made of letters, numbers and underscores, separated by a single dot.
- No other characters besides letters, numbers, underscores, dots, and the "@" symbol should appear in the email address.

For example, your regular expression should match email addresses like: 

`abc@umich.edu`, `8ab.c_def9@example.regex.com`;

But your regex should not match: 

`abc@ def.`, `ab..abc@def.com`, `abc@def`

### Question 7
What is the correct regular expression to match a DOI registered by Crossref? 

A valid DOI (e.g. `doi:10.1038/nphys1170`) defined in this problem must meet the following requirements:

1. The DOI starts with **doi**:
1. The link has two parts divided by a “/”. In the first part, there can only be numbers and dots, and in the second part, there can be any characters. There should be at least one character in each part.

For example, your regex should match DOIs like: `doi:10.1038/nphys1170`, `doi:10.1002/0470841559.ch1`

In [ ]:
import re

pattern = "doi:[\d.]+\/.+"

# Week 2: Intro to Pandas and Series Data

## Intro to Pandas

## The Series Data Structure

In [ ]:
import pandas as pd

friends = ["Jerry", "George", "Elaine", "Kramer", "Newman"]

pd.Series(friends)

0     Jerry
1    George
2    Elaine
3    Kramer
4    Newman
dtype: object

In [ ]:
numbers = [2, 3, 5, 7, 11]

pd.Series(numbers)

0     2
1     3
2     5
3     7
4    11
dtype: int64

In [ ]:
friends = ['Jerry', 'George', None]

pd.Series(friends)

0     Jerry
1    George
2      None
dtype: object

In [ ]:
numbers = [2, 4, 6, None]

pd.Series(numbers)

0    2.0
1    4.0
2    6.0
3    NaN
dtype: float64

In [ ]:
# Creating a Series from a Hash Table

students_scores = {
    "Alice": "Physics",
    "Jack": "Chemistry",
    "Molly": "English"
}

series = pd.Series(students_scores)

series

Alice      Physics
Jack     Chemistry
Molly      English
dtype: object

In [ ]:
series.index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [ ]:
# Creating a Series from a list of Tuples

students = [("Jerry", "Seinfeld"), ("George", "Costanza"), ("Kosmos", "Kramer")]

pd.Series(students)

0     (Jerry, Seinfeld)
1    (George, Costanza)
2      (Kosmos, Kramer)
dtype: object

In [ ]:
# Create a Series by passing in the index separately

pd.Series(['Physics', "Chemistry", "English"], index=['Alice', "Jack", "Molly"])

Alice      Physics
Jack     Chemistry
Molly      English
dtype: object

In [ ]:
students_scores = {
    "Alice": "Physics",
    "Jack": "Chemistry",
    "Molly": "English"
}

pd.Series(students_scores, index=["Alice", "Molly", "Sam"])

Alice    Physics
Molly    English
Sam          NaN
dtype: object

## Querying a Series

In [ ]:
import pandas as pd

students_classes = {
    'alice': 'physics',
    'jack': 'chemistry',
    'molly': 'english',
    'sam': 'history'
}

series = pd.Series(students_classes)

series

alice      physics
jack     chemistry
molly      english
sam        history
dtype: object

In [ ]:
series.iloc[3]

'history'

In [ ]:
# what class does molly have?
# Use indexing operator

series.loc['molly']

'english'

In [ ]:
series['molly']

'english'

In [ ]:
use iloc or loc attributes directly

SyntaxError: ignored

In [ ]:
class_code = {99: 'physics',
              100: "chemistry",
              101: 'english',
              102: 'history'}

series = pd.Series(class_code)

In [ ]:
series[0]

KeyError: ignored

In [ ]:
# iloc means integer-location

series.iloc[0]

'physics'

In [ ]:
# grades
# this is SLOW

grades = pd.Series([90, 80, 70, 60])

total = 0
for grade in grades:
  total += grade
print(total / len(grades))

75.0

In [ ]:
import numpy as np

total = np.sum(grades)
print(total / len(grades))

75.0

In [ ]:
numbers = pd.Series(np.random.randint(0, 1000, 10000))

numbers.head()

0    319
1    745
2    628
3    660
4    948
dtype: int64

In [ ]:
len(numbers)

10000

In [ ]:
# magic function

%%timeit -n 100

total = 0
for number in numbers:
  total += number

total/len(numbers)

100 loops, best of 5: 1.48 ms per loop

In [ ]:
%%timeit -n 100

total = np.sum(numbers)
total/len(numbers)

100 loops, best of 5: 71.9 µs per loop

In [ ]:
numbers.head()

0    319
1    745
2    628
3    660
4    948
dtype: int64

In [ ]:
numbers += 2
numbers.head()

0    321
1    747
2    630
3    662
4    950
dtype: int64

In [ ]:
for label, value in numbers.iteritems():
  # numbers.loc[label] = value + 2
  numbers.at[label] = value + 2
numbers.head()

0    323
1    749
2    632
3    664
4    952
dtype: int64

In [ ]:
%%timeit -n 10

s = pd.Series(np.random.randint(0, 1000, 1000))
for label, value in s.iteritems():
  s.loc[label] = value + 2

10 loops, best of 5: 53.7 ms per loop

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 1000))
s += 2

10 loops, best of 5: 302 µs per loop

In [ ]:
s = pd.Series([1, 2, 3])

s.loc['History'] = 102

s

0            1
1            2
2            3
History    102
dtype: int64

In [ ]:
students_classes = pd.Series({
  'Alice': 'Physics',
  'Jack' : 'Chemistry',
  'Molly': 'English',
  'Sam': 'History'   
})

students_classes

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object

In [ ]:
kelly_classes = pd.Series(['Philosophy', 'Arts', 'Math'], index=['Kelly', 'Kelly', 'Kelly'])
kelly_classes

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [ ]:
all_students_classes = students_classes.append(kelly_classes)

all_students_classes

Alice       Physics
Jack      Chemistry
Molly       English
Sam         History
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [ ]:
all_students_classes.loc['Kelly']

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [ ]:
students_classes

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object

Note: pd.Series is one dimensional

pd.DataFrame is two dimensional

# Week 2: DataFrame

## DataFrame Data Structure

In [ ]:
import pandas as pd

## DataFrame Indexing and Loading

In [ ]:
record1 = pd.Series({'Name': "Alice",
                     'Class':'Physics',
                     'Score': 85})

record2 = pd.Series({'Name': "Jack",
                     'Class':'Chemistry',
                     'Score': 82})

record3 = pd.Series({'Name': "Helen",
                     'Class':'Biology',
                     'Score': 90})

In [ ]:
df = pd.DataFrame([record1, record2, record3], index=['school1', 'school2', 'school3'])

df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [ ]:
# you can also pass an array of dictionaries to a DataFrame

students = [{'Name': "Alice",
                     'Class':'Physics',
                     'Score': 85},
            {'Name': "Jack",
                     'Class':'Chemistry',
                     'Score': 82},
            
            {'Name': "Helen",
                     'Class':'Biology',
                     'Score': 90}]

df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])

df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [ ]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [ ]:
type(df.loc['school2'])

pandas.core.series.Series

In [ ]:
df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [ ]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [ ]:
# you can specify a row and column too

df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [ ]:
# how to select a column
# transpose the matrix

df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [ ]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [ ]:
# This works too, w/o transposing the matrix
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [ ]:
# don't do this
df.loc['Name']

KeyError: ignored

In [ ]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [ ]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [ ]:
df.loc[:, ['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [ ]:
df.loc[:]

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [ ]:
df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     82

In [ ]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [ ]:
copy_df = df.copy()

copy_df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [ ]:
copy_df.drop("Name", axis=1, inplace=True)

In [ ]:
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [ ]:
del copy_df['Class']
copy_df

         Score
school1     85
school2     82
school1     90

In [ ]:
# add a column
df['ClassRanking'] = None
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None